In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
engine = create_engine('sqlite:///sqlite_CaseStudy.db')

In [3]:
# Produce a list of facilities with a total revenue less than 1000.
# The output of facility name and total revenue, sorted by revenue. Remember
# that there's a different cost for guests and members! 
query10 = '''
SELECT f.name, 
SUM(
CASE WHEN b.memid =0
    THEN guestcost * slots
    ELSE membercost * slots
END ) AS revenue
FROM Bookings b
INNER JOIN Facilities f 
ON f.facid = b.facid
GROUP BY f.name
HAVING revenue <1000
ORDER BY revenue
'''

In [4]:
answer10 = pd.read_sql_query(query10, engine)

In [5]:
print(answer10)

            name  revenue
0   Table Tennis      180
1  Snooker Table      240
2     Pool Table      270

In [6]:
# Produce a report of members and who recommended them in alphabetic surname, firstname order
query11 = '''
SELECT x.surname AS Member_Surname, 
x.firstname AS Member_Firstname, 
y.surname AS RecommendedBy_Surname, 
y.firstname AS RecommendedBy_Firstname
FROM Members x
INNER JOIN Members y ON x.recommendedby = y.memid
ORDER BY x.surname, x.firstname
'''

In [7]:
answer11 = pd.read_sql_query(query11, engine)

In [8]:
print(answer11)

       Member_Surname Member_Firstname RecommendedBy_Surname  \
0               Bader         Florence              Stibbons
1               Baker             Anne              Stibbons
2               Baker          Timothy               Farrell
3              Boothe              Tim                Rownam
4             Butters           Gerald                 Smith
5              Coplin             Joan                 Baker
6             Crumpet            Erica                 Smith
7                Dare            Nancy              Joplette
8             Genting          Matthew               Butters
9                Hunt             John               Purview
10              Jones            David              Joplette
11              Jones          Douglas                 Jones
12           Joplette           Janice                 Smith
13          Mackenzie             Anna                 Smith
14               Owen          Charles                 Smith
15             Pinker            David               Farrell
16            Purview        Millicent                 Smith
17             Rumney        Henrietta               Genting
18             Sarwin        Ramnaresh                 Bader
19              Smith             Jack                 Smith
20           Stibbons           Ponder                 Tracy
21  Worthington-Smyth            Henry                 Smith

   RecommendedBy_Firstname
0                   Ponder
1                   Ponder
2                   Jemima
3                      Tim
4                   Darren
5                  Timothy
6                    Tracy
7                   Janice
8                   Gerald
9                Millicent
10                  Janice
11                   David
12                  Darren
13                  Darren
14                  Darren
15                  Jemima
16                   Tracy
17                 Matthew
18                Florence
19                  Darren
20                  Burton
21                   Tracy

In [9]:
# Find the facilities with their usage by member, but not guests
query12 = '''
SELECT name, SUM( slots ) AS total_slots
FROM Bookings b
INNER JOIN Facilities f ON b.facid = f.facid
WHERE b.memid >0
GROUP BY name
'''

In [10]:
answer12 = pd.read_sql_query(query12, engine)

In [11]:
print(answer12)

              name  total_slots
0  Badminton Court         1086
1   Massage Room 1          884
2   Massage Room 2           54
3       Pool Table          856
4    Snooker Table          860
5     Squash Court          418
6     Table Tennis          794
7   Tennis Court 1          957
8   Tennis Court 2          882

In [12]:
# Find the facilities usage by month, but not guests
query13 = '''
SELECT name, SUM( slots ) AS total_slots, strftime('%m',b.starttime) as month
FROM Bookings b
INNER JOIN Facilities f ON b.facid = f.facid
WHERE b.memid >0
GROUP BY name, month
'''

In [13]:
answer13 = pd.read_sql_query(query13, engine)

In [14]:
print(answer13)

               name  total_slots month
0   Badminton Court          165    07
1   Badminton Court          414    08
2   Badminton Court          507    09
3    Massage Room 1          166    07
4    Massage Room 1          316    08
5    Massage Room 1          402    09
6    Massage Room 2            8    07
7    Massage Room 2           18    08
8    Massage Room 2           28    09
9        Pool Table          110    07
10       Pool Table          303    08
11       Pool Table          443    09
12    Snooker Table          140    07
13    Snooker Table          316    08
14    Snooker Table          404    09
15     Squash Court           50    07
16     Squash Court          184    08
17     Squash Court          184    09
18     Table Tennis           98    07
19     Table Tennis          296    08
20     Table Tennis          400    09
21   Tennis Court 1          201    07
22   Tennis Court 1          339    08
23   Tennis Court 1          417    09
24   Tennis Court 2          123    07
25   Tennis Court 2          345    08
26   Tennis Court 2          414    09